{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"content":4},"03-10-2025","gitting gud",["null","default",5],"# disasterpeace berklee Q+A\r\n\r\ni had the privilege of being able to attend a Q+A with [rich vreeland (disasterpeace)](https://disasterpeace.com/#) at berklee's [video game music club](https://www.instagram.com/berkleevgmc/) (opens instagram). the interview was conducted primarily by the president of the club, with a public Q+A section near the end. last thing: a disclaimer! i *heavily* paraphrased everything and these exist more as highly condensed (arguably low quality) notes, hence the \"mote cut.\" i cannot take notes at the speed of conversation, unfortunately. anyways, here are my notes!\r\n\r\nQ: vgmc lore?\r\n\r\nA: filipo, shota nakama, akash nakar, sean sincalir, qien hao all were there!\r\n\r\nQ: berklee experience?\r\n\r\nA: before berklee didn't have the language to communicate;\r\nhyper-competitive atmosphere among performers, pivoted to EPD\r\n\r\nQ: talk about fez music; what makes chiptune feel chiptune?\r\n\r\nA: unfiltered waveforms, recontextualized those sounds to be more cinematic\r\n\r\nQ: hyper light drifter; what inspired you to make it the way it is?\r\n\r\nA: use piano to create a dichotomy. end of something is a great place to break rules\r\n\r\nQ: anything else about synths that draws you to them?\r\n\r\nA: expression; control over timbre is fun and highly expressive\r\nplayed with nord modular synth software\r\n\r\nQ: january; speak\r\n\r\nA: game jam at MIT media lab, felt inspired to make something of his own\r\nused flixl -- gradually built, getting more and more technical\r\nif this note --> list of notes that work; highly probabilistic\r\n\r\nQ: helped with working on mini metro?\r\n\r\nA: went back to january, cleaned it up; people played it\r\nmini metro devs wanted a procedural score!\r\n\r\nQ: how has your process evolved, particularly with paradise marsh?\r\n\r\nA: inspired by botw; phrase-based open world music\r\n3 elements: pad bass keys; manipulate phrases in generative way\r\nplay with timing offset; transposition; reversal; FX\r\n\r\nQ: rhythm game time; different process?\r\n\r\nA: wife texted him, responded immediately\r\nanyways, dont need to worry about motifs, have fun!\r\nno strong external goal\r\nworked on everhood: eternity edition\r\n\r\nR: past the ambition stage, maximizing time\r\nsolar ash was a grind\r\n\r\nQ: solar ash?\r\n\r\nA: worked more on audio systems -- learning unreal engine technical sound design\r\n\r\nQ: movies time; different process for movies?\r\n\r\nA: process is as different as you want it to be\r\n\"what do you think the game needs?\"\r\ndont be overly ambitious -- interactive music is hard to do well\r\nwrite something BEFORE prototyping generative part\r\nfilm is painting by numbers -- fill in music more statically\r\nfilm is more freeing because you do more music writing than coding\r\n\r\nQ: how did you get here?\r\n\r\nA: say yes to EVERYTHING\r\nmake mistakes to understand what you like and dislike\r\ntry as many things as you can\r\npick your battles\r\n\r\nQ: writing standalone music; comparable to rhythm games?\r\n\r\nA: yes, learned that he worked better with a concept\r\nwriting music for yourself is not necessarily like that, blank page is too freeing\r\nlatch onto a given concept\r\n\r\nQ: genres, artists, other inspirations?\r\n\r\nA: chrono-cross, koji kondo, flowx\r\npicked up different influences along the way\r\ninterested in many different genres throughout his career\r\nbernard herman for orchestral music\r\n\r\nQ: circle back to berklee --> advice for what people should focus on?\r\n\r\nA: had a busy musical life outside of school\r\ndidnt integrate well with school life\r\nfocused more on message boards and solo artist life\r\nconnecting with like-minded people\r\nboston 8-bit, other outside school things\r\nused classes to experiment\r\nberklee is notorious for having a \"berklee sound\"\r\n\r\n## PUBLIC Q+A\r\n\r\nQ: worked with csound?\r\n\r\nA: no, messed with max a bit\r\nthey live outside the middleware\r\ndependency issues\r\n\r\nQ: make a living just composing?\r\n\r\nA: possible, its a creative field, so play to your strengths\r\ndabbled in a lot of stuff, music is what hes known for\r\n\r\nQ: website tags?\r\n\r\nA: tag cloud; tag posts with different tags and arrange them by size\r\n\r\nQ: how did you break in?\r\n\r\nA: played shows with boston 8-bit, one in montreal\r\ndevs for fez were there\r\ncompilation originally, wheedled down to just him\r\n\r\nhyper light drifter -- did shows with a drummer/game dev\r\ndrummer was friends with alex hirsch/saw hld kickstarter\r\nconnected!\r\n\r\nQ: implementation: fmod or wwise?\r\n\r\nA: fmod, wwise is too brutalist\r\nHATE middleware\r\nsolar ash -- only used unreal, lots of downsides but very fun!\r\n\r\nQ: creative blocks?\r\n\r\nA: heart machine; block had to do with interpersonal issues rather than work\r\naccept that work might be shitty\r\nbreaking creative blocks: copely strategies from brian eno\r\n\r\nQ: it follows tech stack?\r\n\r\nA: mostly massive, from berklee bundle\r\nmassive x SUCKS\r\n\r\nQ: how did you get into live shows?\r\n\r\nA: met berklee people through synth lab at EPD\r\nthose people helped with boston 8-bit\r\n\r\nQ: favorite game?\r\n\r\nA: too hard. top 3: morrowwind if it wasnt janky, old sports games\r\n\r\nQ: favorite game soundtrack?\r\n\r\nA: chrono-cross, mashinarium, yoshi's island\r\n"],"uses":{"params":["slug"]}}]}
