{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"content":4},"03-10-2025","gitting gud",["null","default",5],"# gitting gud\r\n\r\n## writing\r\n\r\nsometimes i really do just feel like writing. i don't really feel like i have much to write about sometimes, particularly in this moment, but it's nice to have a place to do so.\r\n\r\n## that's what i'll write about\r\n\r\nhaving a personal website and taking the time to beef it up has been a pretty nice thing to look forward to. gone are the days of being clutched by how many likes i didn't get on my last tiktok. i still check in on tiktok from time to time using my partner as a conduit (whom i talk about a lot (i just wanted the opportunity to link my posts about her ^_^))... but i dont really miss it outside of the discussions and smiles it brings us on a fairly irregular basis\r\n...\r\nanyways, i'm rambling a bit. the reason i write today is because im starting to truly feel the effects of being a normal person. school is going remarkably well – with me finding a passion i want to pursue more than video game sound design – my social life isn't completely awful, and i have a bunch of fun trips lined up! i believe that as i get better at the things i do, i feel more supported by those around me because i am actively showing off what i can do. this is a novel thing to me! when i started college, i thought i was gonna end up composing or doing live shows, but that wasn't my groove. now that i've found it (my groove) i truly feel like i contribute to the people around me.\r\n...\r\non that note, i haven't teared up in a while... okay i'm lying. i've been playing the witness a bit and did NOT expect to be HIT by a FREIGHT train (don't worry, this is related). there's a woman who talks about the concept of aspiration and desire being a fundamental part of a person's sense of self, and how that's sometimes stunting to a person's happiness. i think that i don't need to tell myself what i want to do anymore, i just do it, which i why i've been feeling a lot better lately. don't get me wrong – i still have a LOT of work to do on myself, but i think i'm getting to one of the best places i've been in my life (fingers crossed, knock on wood, salt over the shoulder, PLEASE beam luck to me).\r\n...\r\nanyways (again), i'm just about done here. if you're still reading, id recommend you check out my rss feed for this blog. thank you for passing through, and i hope to see you in the next one, he shouts into the void.\r\n"],"uses":{"params":["slug"]}}]}
