{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"content":4},"09-04-2024","Power Underneath Despair / IndieWeb Carnival September 2024",["null","default",5],"# site updates!!!!!!!!!!!\r\n\r\nI'M BACK WITH A FRESH COAT OF PAINT!! over the course of the past 6 months or so a lot has happened in the world of mike, so now you're gonna read about it (i've included a tl;dr right below this in case you don't really care about all the details).\r\n\r\n## at-a-glance\r\n\r\n- learned svelte\r\n\r\n- graduated [berklee](https://berklee.edu)\r\n\r\n- launched a [zine](https://antikszine.neocities.org)\r\n\r\n- went to el salvador\r\n\r\n- made [sand sing](https://github.com/mikeoat/singing-sand)\r\n\r\n## lets go\r\n\r\n### svelte\r\n\r\nthe beauty that is gracing your eyes right now is the updated version of my website written in [svelte](https://svelte.dev). i decided on svelte because of its static site generation capabilities. i love not having to link 500 million things. now, for new blog posts, i just write a markdown document and add associated data in a separate file. super easy\r\n\r\nas for other pages, i encourage you to explore! theres stuff hidden around. i'm particularly proud of my new [projects page](https://mote.moe/projects). everything (again) is dynamically created then adapted into a static site... AND all my music is hosted there. it's pulled from github at the moment, maybe one day i'll update my homelab to include my website.\r\n\r\n## graduated\r\n\r\ni cannot believe its time for real life now. after 3.5 years i'm done. i'm excited but also incredibly nervous about what the future holds for me, but the only way to find out is to be there. i hope i find some sort of opportunity at [NAMM](https://namm.org), since i'm very eager to start doing some DSP!! if that doesn't work out, i'll still be applying to various grad schools... hopefully i'll be able to move somewhere nice where i can make my weird noises and share and develop them with other folks.\r\n\r\nmy ideal plan is to look for an opportunity at NAMM so that i can learn on the job, since i think the more fast-paced environment there is a better fit for me. if not, i'll still get to meet some cool people and see some cool new tools! especially with AI getting so big, i'm excited to see if/how that's implemented in hardware.\r\n\r\n## launched a zine\r\n\r\nmost of how i learned svelte came from developing the site for **antiks**, a new web/physical zine that take submissions from a select group of artists. the first zine's theme is going to be \"lost and found.\" i'm excited to get working on the hosting platform for it. it's sure to have all sorts of old-web goodness.\r\n\r\n## went to el salvador\r\n\r\nvery fun trip! it's not quite what i expected as a white american, especially considering its a third world country. had a lot of fun! got to ride in the back of a truck, eat sugar cane, talk to SUPER friendly people, etc etc. my gf also met her family for the first time which was rather emotional for the both of us, but in a good way. i'm very happy that her family is in her life now!\r\n\r\n## made sand sing\r\n\r\nsinging sand is a phenomenon that happens in various deserts and beaches around the world. the principles behind it are pretty cool, but i won't explain them here since youll be able to read the paper soon! all of my code for it is open source and [can be accessed at this link](https://github.com/mikeoat/singing-sand).\r\n\r\n## end\r\n\r\nthat's it! i want to post on my blog a bit more. this year i want to try to keep up with the [indieweb carnival](https://indieweb.org/IndieWeb_Carnival) to try writing more. i'll set up an rss feed eventually... gotta figure out how to do *that* with svelte -_-\r\n"],"uses":{"params":["slug"]}}]}
