{"type":"data","nodes":[null,{"type":"data","data":[{"post":1},{"slug":2,"title":3,"content":4},"09-04-2024","Power Underneath Despair / IndieWeb Carnival September 2024",["null","default",5],"# power underneath despair\r\n\r\nlooking down at the ground from a great height, i wonder why it is that i don't jump.\r\n\r\nit could be pride, fear, love, anything – but not a rational decision to leave, at least for me.\r\n\r\ni think back just a few years to when i stood on a chair waiting to kick it away and watch it all fade to black. but i didnt. i'm still here and everyone around me gets to deal with me... and theres not much they can do about it.\r\n\r\nat my most beaten and broken, i still kept going. i kept moving. something got that cord away from me and got me safely down from that chair. i now look back on with pride and happiness. pride and happiness that i found that strength in such adversity. there's something truly awesome about getting up, dusting the fuck off, and getting back to it.\r\n...\r\ni could lament forever about the event, thinking my own head into mush about how i escaped such a near-death experience by my own hand (one i also put myself in by my own hand), but instead what i want to talk about is why exactly i got down from that chair in that moment.\r\n\r\nlets cut to the chase: the thing that gave me power was not something. im sorry to disappoint if that was something you were looking for. instead, i think something much more weird and trippy and ephemeral got me down that existed within my own mind.\r\nhaving been a stinky gross reddit user in my high school days, i have read many a tale and many a meme about \"my dog wouldnt understand\" or \"mom would be sad\" etc etc. these are not the things that saved me.\r\n\r\ninstead, the ephemeral thing (yes i like that word) im talking about is the thing that saved me. to this day, i dont know what it was. obviously i rationalized it many times in the weeks, months... and years... following. maybe it WAS my dog, or my mom, or instinct, or i thought it wouldnt work, or i was too scared – it doesnt matter because none of that is the truth.\r\n\r\nthe TRUTH is that i dont know what gave me the strength to go on, but im not scared of not knowing anymore. im not scared of losing that strength. im not scared of trying to kill myself again.\r\n\r\nonly recently have i truly been able to accept my experience as an experience i had, and one that i fucking spat in the face of. because i lived, bitch, and i get to experience the world now. i get to live my life to fullest extent that i can live it, and im going to work as hard as i can to make my life the best one i can live. because i deserve it. everyone deserves it.\r\n\r\nmy life is mine to live now. i will never try to take it from myself again. i know now what i have after many years of turmoil and hiding.\r\n\r\ni will not quit that easily.\r\n"],"uses":{"params":["slug"]}}]}
